# Core dev tools
brew "git-lfs"
brew "gh"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "zoxide"
brew "tree"
brew "watch"
brew "wget"
brew "trash"

# Languages & runtimes
brew "node"
brew "python@3.13"

# Cloud & infra
brew "azure-cli"
brew "terraform"

# Casks
cask "1password"
cask "iterm2"
cask "visual-studio-code"
cask "maccy"
cask "claude-code"
